{
  "common": {
    "name": "google-home-nest",
    "version": "0.3.0",
    "news": {
      "0.3.0": {
        "en": "(Daniel Drießen) Added important information to the README file.\n(Daniel Drießen) Added basic setup documentation in german and english.\n(Daniel Drießen) Removed automatic deletion of all stored device objects upon adapter start.\n(Daniel Drießen) Added automatic deletion of all stored device objects that can't be found online.\n(Daniel Drießen) Added option to recreate device object structure upon next adapter start.",
        "de": "(Daniel Drießen) Wichtige Informationen zur README-Datei hinzugefügt.\n(Daniel Drießen) Hinzugefügt grundlegende Setup-Dokumentation in Deutsch und Englisch.\n(Daniel Drießen) Entfernt automatische Löschung aller gespeicherten Geräteobjekte beim Adapterstart.\n(Daniel Drießen) Hinzugefügt automatische Löschung aller gespeicherten Geräteobjekte, die nicht online gefunden werden können.\n(Daniel Drießen) Option hinzugefügt, um die Geräteobjektstruktur beim nächsten Adapterstart wiederherzustellen.",
        "ru": "(Daniel Drießen) Добавлена важная информация в файл README.\n(Daniel Drießen) Добавлена основная настройка документации на немецком и английском языках.\n(Daniel Drießen) Удалено автоматическое удаление всех сохраненных объектов устройства при запуске адаптера.\n(Daniel Drießen) Добавлено автоматическое удаление всех сохраненных объектов устройства, которые не могут быть найдены в Интернете.\n(Daniel Drießen) Добавлена возможность воссоздать структуру объекта при следующем запуске адаптера.",
        "pt": "(Daniel Drießen) Adicionado informações importantes para o arquivo README.\n(Daniel Drießen) Adicionado documentação de configuração básica em alemão e inglês.\n(Daniel Drießen) Eliminação automática removida de todos os objetos de dispositivo armazenados no início do adaptador.\n(Daniel Drießen) Adicionado eliminação automática de todos os objetos de dispositivo armazenados que não podem ser encontrados on-line.\n(Daniel Drießen) Opção adicionada para recriar a estrutura do objeto do dispositivo no próximo início do adaptador.",
        "nl": "(Daniel Drießen) Belangrijke informatie toegevoegd aan het README-bestand.\n(Daniel Drießen) Toegevoegd basis setup documentatie in het Duits en Engels.\n(Daniel Drießen) Verwijderde automatische verwijdering van alle opgeslagen apparaatobjecten bij het starten van de adapter.\n(Daniel Drießen) Toegevoegd automatische verwijdering van alle opgeslagen apparaat objecten die niet online kan worden gevonden.\n(Daniel Drießen) Toegevoegd optie om apparaat objectstructuur na te maken bij volgende adapter start.",
        "fr": "(Daniel Drießen) Ajout d'informations importantes au fichier README.\n(Daniel Drießen) Ajout de la documentation de base en allemand et en anglais.\n(Daniel Drießen) Supprimé la suppression automatique de tous les objets de périphérique stockés lors du démarrage de l'adaptateur.\n(Daniel Drießen) Ajout de la suppression automatique de tous les objets de périphérique stockés qui ne peuvent pas être trouvés en ligne.\n(Daniel Drießen) Ajout d'une option pour recréer la structure de l'objet au prochain démarrage de l'adaptateur.",
        "it": "(Daniel Drießen) Aggiunto importanti informazioni al file README.\n(Daniel Drießen) Aggiunta la documentazione di configurazione di base in tedesco e inglese.\n(Daniel Drießen) Eliminato cancellazione automatica di tutti gli oggetti del dispositivo memorizzati all'inizio dell'adattatore.\n(Daniel Drießen) Aggiunta cancellazione automatica di tutti gli oggetti di dispositivo memorizzati che non possono essere trovati online.\n(Daniel Drießen) Aggiunta opzione per ricreare la struttura dell'oggetto del dispositivo al prossimo avvio dell'adattatore.",
        "es": "(Daniel Drießen) Añadido información importante al archivo README.\n(Daniel Drießen) Se agregó documentación básica de configuración en alemán e inglés.\n(Daniel Drießen) Eliminado automático de todos los objetos del dispositivo almacenados al inicio del adaptador.\n(Daniel Drießen) Se agregó la eliminación automática de todos los objetos del dispositivo almacenados que no se pueden encontrar en línea.\n(Daniel Drießen) Añadido opción para recrear la estructura del objeto del dispositivo en el próximo comienzo del adaptador.",
        "pl": "(Daniel Drießen) Dodano ważne informacje do pliku README.\n(Daniel Drießen) Dodano podstawową dokumentację konfiguracji w języku niemieckim i angielskim.\n(Daniel Drießen) Usunięto automatyczne usuwanie wszystkich zapisanych obiektów urządzenia po uruchomieniu adaptera.\n(Daniel Drießen) Dodano automatyczne usuwanie wszystkich zapisanych obiektów urządzeń, których nie można znaleźć online.\n(Daniel Drießen) Dodano opcję odtworzenia struktury obiektu urządzenia przy następnym uruchomieniu adaptera.",
        "uk": "(Daniel Drießen) Додана важлива інформація до файлу README.\n(Daniel Drießen) Додано основну документацію налаштування німецькою та англійською мовами.\n(Daniel Drießen) Вилучено автоматичне видалення всіх збережених об'єктів пристрою при запуску адаптера.\n(Daniel Drießen) Додано автоматичне видалення всіх збережених об'єктів пристроїв, які не можна знайти в Інтернеті.\n(Daniel Drießen) Додано параметр для відтворення структури об'єкта пристрою на наступному запуску адаптера.",
        "zh-cn": "(丹尼尔·德利根) 添加到 README 文件的重要信息 .\n(丹尼尔·德利根) 增加了德国语和英语的基本设置文档.\n(丹尼尔·德利根) 在适配器启动时取消了所有存储设备对象的自动删除 .\n(丹尼尔·德利根) 添加了无法在网上找到的所有存储设备对象的自动删除.\n(丹尼尔·德利根) 在下一个适配器启动时添加了重新创建设备对象结构的选项 ."
      },
      "0.2.0": {
        "en": "(Daniel Drießen) Improved admin panel and corrected some text.\n(Daniel Drießen) Added missing translations on the admin panel.",
        "de": "(Daniel Drießen) Verbesserte Admin-Panel und korrigierte einen Text.\n(Daniel Drießen) Hinzugefügt fehlende Übersetzungen auf dem Admin-Panel.",
        "ru": "(Daniel Drießen) Улучшена панель администратора и исправлена часть текста.\n(Daniel Drießen) Добавлены недостающие переводы на панели администратора.",
        "pt": "(Daniel Drießen) Painel de administração melhorado e corrigiu algum texto.\n(Daniel Drießen) Adicionadas traduções em falta no painel de administração.",
        "nl": "(Daniel Drießen) Verbeterde admin paneel en gecorrigeerd sommige tekst.\n(Daniel Drießen) Toegevoegd ontbrekende vertalingen op het beheerpaneel.",
        "fr": "(Daniel Drießen) Amélioration du panneau d'administration et correction du texte.\n(Daniel Drießen) Ajout de traductions manquantes sur le panneau d'administration.",
        "it": "(Daniel Drießen) Pannello di amministrazione migliorato e corretto alcuni testo.\n(Daniel Drießen) Aggiunte le traduzioni mancanti sul pannello di amministrazione.",
        "es": "(Daniel Drießen) Panel de administración mejorado y corrigió algún texto.\n(Daniel Drießen) Añadido traducciones perdidas en el panel de administración.",
        "pl": "(Daniel Drießen) Ulepszony panel administracyjny i poprawiony tekst.\n(Daniel Drießen) Dodano brakujące tłumaczenia na panelu administracyjnym.",
        "uk": "(Daniel Drießen) Удосконалено панель адміністратора та виправлено текст.\n(Daniel Drießen) Додано відсутні переклади на адмін панелі.",
        "zh-cn": "(丹尼尔·德利根) 改进了管理面板并更正了一些案文.\n(丹尼尔·德利根) 在管理面板上添加缺失的翻译 ."
      },
      "0.1.2": {
        "en": "(Daniel Drießen) Modified admin page\n(Daniel Drießen) Changed 'redirectURI' back to 'localhost'",
        "de": "(Daniel Drießen) Modified admin page\n(Daniel Drießen) 'redirectURI' zurück zu 'localhost '",
        "ru": "(Daniel Drießen)\n(Daniel Drießen) Перенаправлено с «localhost» \"",
        "pt": "(Daniel Drießen) Página de administração modificada\n(Daniel Drießen) Alterado 'redirectURI' de volta para 'localhost '",
        "nl": "(Daniel Drießen) Gewijzigde admin pagina\n(Daniel Drießen) Veranderde 'redirectURI' terug naar 'localhost '",
        "fr": "(Daniel Drießen) Page d'administration modifiée\n(Daniel Drießen) Changement de «redirecturi» à «localhost» '",
        "it": "(Daniel Drießen) Modificata pagina di amministrazione\n(Daniel Drießen) Cambiato 'redirectURI' di nuovo a 'localhost '",
        "es": "(Daniel Drießen)\n(Daniel Drießen) cambió 'redirectURI' de nuevo a 'localhost '",
        "pl": "(Daniel Drießen) Zmodyfikowana strona administratora\n(Daniel Drießen) Changed 'redirectURI' back to 'localhost'",
        "uk": "(Daniel Drießen) Змінено сторінку адміністратора\n(Daniel Drießen) Змінено 'redirectURI' назад до 'localhost Р",
        "zh-cn": "(Daniel Drießen) 修改后的管理员页面\n(Daniel Drießen) 将“ 直接URI” 改为“ 本地主机 ”  '"
      },
      "0.1.2-beta.0": {
        "en": "(Daniel Drießen) Modified Readme file",
        "de": "(Daniel Drießen) Geänderte Readme-Datei",
        "ru": "(Daniel Drießen)",
        "pt": "(Daniel Drießen) Modified Readme file",
        "nl": "(Daniel Drießen) Gewijzigd Readme-bestand",
        "fr": "(Daniel Drießen) Fichier de lecture modifié",
        "it": "(Daniel Drießen) Modificato file Readme",
        "es": "(Daniel Drießen)",
        "pl": "(Daniel Drießen) Zmodyfikowany plik Readme",
        "uk": "(Daniel Drießen) Модифікований файл",
        "zh-cn": "(Daniel Drießen) 修改后的Readme文件"
      },
      "0.1.1-beta.0": {
        "en": "(Daniel Drießen) Corrected dependencies.",
        "de": "(Daniel Drießen) Korrigierte Abhängigkeiten.",
        "ru": "(Daniel Drießen) Исправленные зависимости.",
        "pt": "(Daniel Drießen) Dependências corrigidas.",
        "nl": "(Daniel Drießen) Gecorrigeerde afhankelijkheden.",
        "fr": "(Daniel Drießen) Des dépendances corrigées.",
        "it": "(Daniel Drießen) Dipendenze corrette.",
        "es": "(Daniel Drießen) Dependencias corregidas.",
        "pl": "(Daniel Drießen) Skorygowane zależności.",
        "uk": "(Daniel Drießen) Виправлені залежності.",
        "zh-cn": "(丹尼尔·德利根) 纠正依赖关系."
      },
      "0.1.0-beta.0": {
        "en": "Initial beta version release",
        "de": "Erste Beta Version Release",
        "ru": "Начальная версия бета-версии",
        "pt": "Versão inicial beta",
        "nl": "Eerste versie van beta",
        "fr": "Version bêta initiale",
        "it": "Versione beta iniziale",
        "es": "Primera versión beta",
        "pl": "Początkowe wydanie wersji beta",
        "uk": "Ім'я користувача",
        "zh-cn": "初始β版本发布"
      },
      "0.0.1": {
        "en": "initial release",
        "de": "Erstveröffentlichung",
        "ru": "Начальная версия",
        "pt": "lançamento inicial",
        "nl": "Eerste uitgave",
        "fr": "Première version",
        "it": "Versione iniziale",
        "es": "Versión inicial",
        "pl": "Pierwsze wydanie",
        "uk": "Початкова версія",
        "zh-cn": "首次出版"
      }
    },
    "titleLang": {
      "en": "Google Home (Nest)",
      "de": "Google Home (Nest)",
      "ru": "Главная страница Google (гнездо)",
      "pt": "Página inicial do Google (Ninho)",
      "nl": "Google Home (Nest)",
      "fr": "Accueil Google (Nid)",
      "it": "Google Home (Nido)",
      "es": "Página principal de Google (Nido)",
      "pl": "Strona główna Google (gniazdo)",
      "uk": "Google Home (Nest)",
      "zh-cn": "谷歌主页（鸟巢）"
    },
    "desc": {
      "en": "Integrate your Google Home (Nest) devices like Thermostats, Cameras, Doorbells, etc.",
      "de": "Integrieren Sie Ihre Google Home (Nest) Geräte wie Thermostate, Kameras, Türklingeln usw.",
      "ru": "Интегрируйте свои устройства Google Home (Nest), такие как термостаты, камеры, дверные звонки и т. д.",
      "pt": "Integre seus dispositivos Google Home (Nest), como termostatos, câmeras, campainhas, etc.",
      "nl": "Integreer uw Google Home (Nest) apparaten zoals thermostaten, camera's, deurbellen, etc.",
      "fr": "Intégrez vos appareils Google Home (Nest) comme les thermostats, les caméras, les sonnettes, etc.",
      "it": "Integra i tuoi dispositivi Google Home (Nest) come termostati, videocamere, campanelli, ecc.",
      "es": "Integre sus dispositivos Google Home (Nest) como termostatos, cámaras, timbres, etc.",
      "pl": "Zintegruj swoje urządzenia Google Home (Nest), takie jak termostaty, kamery, dzwonki do drzwi itp.",
      "uk": "Інтегруйте пристрої Google Home (Nest), як-от термостати, камери, дверні дзвінки тощо.",
      "zh-cn": "集成您的 Google Home (Nest) 设备，例如恒温器、相机、门铃等。"
    },
    "authors": [
      "Daniel Drießen <daniel.driessen@ddproductions.de>"
    ],
    "keywords": [
      "google",
      "home",
      "nest",
      "thermostat",
      "camera",
      "doorbell",
      "iot",
      "google-home"
    ],
    "tier": 2,
    "licenseInformation": {
      "license": "MIT",
      "type": "free"
    },
    "platform": "Javascript/Node.js",
    "main": "main.js",
    "icon": "google-home-nest.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/danieldriessen/ioBroker.google-home-nest/main/admin/google-home-nest.png",
    "readme": "https://github.com/danieldriessen/ioBroker.google-home-nest/blob/main/README.md",
    "loglevel": "info",
    "mode": "daemon",
    "type": "iot-systems",
    "compact": true,
    "connectionType": "cloud",
    "dataSource": "push",
    "adminUI": {
      "config": "json"
    },
    "dependencies": [
      {
        "js-controller": ">=5.0.19"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=6.17.13"
      }
    ]
  },
  "native": {
    "httpServerPort": 8881,
    "clientID": "",
    "projectID": "",
    "clientSecret": "",
    "googleCloudProjectID": "",
    "eventsEnabled": false,
    "eventsAcquisitionMethod": "PULL",
    "eventsPullTimeout": 1,
    "recreateDeviceObjectStructure": false
  },
  "objects": [],
  "instanceObjects": [
    {
      "_id": "info",
      "type": "channel",
      "common": {
        "name": {
          "en": "Information",
          "de": "Informationen",
          "ru": "Информация",
          "pt": "Informação",
          "nl": "Informatie",
          "fr": "Information",
          "it": "Informazioni",
          "es": "Información",
          "pl": "Informacja",
          "uk": "Інформація",
          "zh-cn": "信息"
        }
      },
      "native": {}
    },
    {
      "_id": "info.connection",
      "type": "state",
      "common": {
        "name": "Service connected",
        "type": "boolean",
        "role": "indicator.connected",
        "read": true,
        "write": false,
        "def": false
      },
      "native": {}
    }
  ]
}
